---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizeSettings.GetConduitSizeSettings(Autodesk.Revit.DB.Document)
source: html/f46950b6-1f00-7137-663f-cf1fb8b5e99a.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeSettings.GetConduitSizeSettings Method

Gets the conduit size settings of the project.

## Syntax (C#)
```csharp
public static ConduitSizeSettings GetConduitSizeSettings(
	Document aDoc
)
```

## Parameters
- **aDoc** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The conduit size settings of the project.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null